{
  "lastUpdate": 0,
  "data": [
    {
      "h": "Placement Phase 1 | Day 6",
      "summary": "The sixth day of the Placement session saw a total of 65 job offers being made to the students. The day witnessed 15 companies visiting the campus. HCL turned out to be the biggest recruiter with the recruitment of 16 students, followed by Brillio(7), Sigmoid (6), TVS(6), Zest money (6), Rolls Royce (4), Loadshare (4), HSBC (3), Aditya Imaging (3), PWC (3) etc. Students placed belonged to different courses including Dual Degree+Msc(5 yr.) (34), B.Tech. (18) , M.Tech. (10) and PhD's(3). Awaaz, IIT Kharagpur congratulates all the placed students. We wish them all the best !!",
      "images": [
        "dummy.jpg",
        "dummy.jpg",
        "dummy.jpg"
      ],
      "videos": [
        ""
      ],
      "time": 1512717755
    },
    {
      "h": "",
      "summary": "The number of job offers crossed 1000 in just 5 days of this ongoing placement session (including Pre-Placement Offers). This has been the fastest that IIT Kharagpur has got 1000+ job offers. Last year, it took 6 days to achieve the same feat, it took only 5 days for the same this year. First 5 days of the placement session saw 170, 247, 162, 87, and 92 job offers being made respectively. And there were 290+ Pre-Placement Offers already in the bag even before the placement session started. This couldn't have been possible without the relentless efforts of the entire CDC team including student placement committee members, professors, vice-chairman, chairman and other staff members. A thousand students have been placed so far with many more to come. Awaaz, IIT Kharagpur congratulates all the CDC placement committee members,staffs professors and everyone else who contributed. We congratulate placed students also advise those who haven't been placed yet to keep on trying and fighting hard.",
      "images": [
        " dummy.jpg "
      ],
      "videos": [
        ""
      ],
      "time": 1575703355
    },
    {
      "h": "",
      "summary": "The Town Official Language Implementation Committee(TOLIC), Kharagpur is going to organize a competition on Summary Writing from the proses of Premchand, and a Cultural Literary Analysis. The competition will held on 9th Dec, 2019 at S.N Bose Auditorium Room.\n The  key events of the competition will be Summary Writing on any randomly allotted prose by Premchand from the given list, followed by a guest lecture by Dr. Om Nischal (Eminent Lyricist, Critic and Senior Manager at Official Language Bank, Allahabad) and a presentation on Cultural and Literary Analysis on Hindi by Dr. Om Nischal, Shri. Munindra Mishra and Pt. Om Prakash Mishra from Literature Team, Kolkata.\n This competition will generate the love, respect and importance for Rajbhasha in one's mind. Competitors will get an exposure towards Hindi Literature and it's grammatical values.\n Awaaz, IIT Kharagpur wishes a best of luck to all competitors and organizers for it's most fruitful and healthy outcome.\n For online registration, kindly visit at: https : //docs.google.com/…/1FAIpQLSczpB0QC3kGK4iLa_…/viewform",
      "images": [
        "dummy.jpg",
        "dummy.jpg"
      ],
      "videos": [
        ""
      ],
      "time": 1575789804
    },
    {
      "h": "",
      "summary": "National Service Scheme (NSS), IIT Kharagpur organized the annual camp in the village of Shyameshwarpur (about 4 km from the campus), during 28th November to 4th December. The camp was aimed towards inculcating the value of volunteering in the students through helping the village people. The 15 NSS Units were allotted different locations to work upon. The NSS volunteers indulged in activities like road construction, clearing grasses and bushes, digging holes for plantations, sanitary and drains. Units 12 and 14 worked in the villages of Sholadhar and Nachna respectively, while other units were working there itself. They also organised a medical camp, and distributed clothes in the villages collected by volunteers earlier. The camp schedule was divided into two sessions. In the first half (7 am to 12: 30 pm), the volunteers did their fieldwork in allotted locations. In the next half (2 pm to 4 pm), certain social activities like an awareness rally, or lectures were organized, whose topics included: First Aid awareness, CPR training ; stress management ; happiness and well-being, and effects of substance abuse. These talks were given by professors, doctors, psychiatrist and counsellors. Besides these, each Unit performed a Nukkad on 2nd December, to address certain social issues like girl education, gender roles and prevailing superstitions. On the last day, evaluation of work done by all Units was done. It followed a session where professors and students shared their experience of the camp. The students felt that they have learnt and done something beautiful during this camp. Finally, the results were announced. Unit 5 won Gold for best fieldwork, followed by Unit 6 (Silver) and Unit 1 (Bronze). Unit 2 performed the Best Nukkad. ",
      "images": [
        ""
      ],
      "videos": [
        ""
      ],
      "time": 1575751600
    },
    {
      "h": "Placement Phase 1 | Day 4",
      "summary": " On the Fourth day of Placements, a total of 87 offers were made by 22 companies. Reliance Jio Infocom and Udaan recruited 8 students each followed by TCG Digital(7), IDFC(6), Embibe SDE (6), Standard Chartered(6), ExxonMobil (5), Synopsis(4), ZS Associates(4), EY GDS(4), etc. Students placed belonged to different courses including B.Tech (22), Dual Degree + Msc. (53), M.Tech (9) and Intellectual Property Law(3). Awaaz, IIT Kharagpur congratulates all the selected students and hopes that all the students continue their excellent performance so far and touch new heights!!! ",
      "images": [
        "dummy.jpg",
        "dummy.jpg",
        "dummy.jpg"
      ],
      "videos": [
        ""
      ],
      "time": 1573111355
    },
    {
      "h": "Placement Phase 1 | Day 3",
      "summary": "The Third day of the Placement Phase witnessed a total of 162 offers made by 25 companies making it 579 offers so far in this placement session. Honeywell was the biggest recruiter recruiting 34 students followed by Bajaj Finserv (15), Samsung Research Institute(13), Axis Bank (12), Ola (10), Mercedes (9), ICICI (8), Societe Generale(7), etc. Students placed belonged to different courses including B.Tech (51), Dual Degree + Msc. (65), M.Tech (45), etc. Awaaz, IIT Kharagpur congratulates all the selected students and wishes them all the best for their further journey !! ",
      "images": [
        "dummy.jpg"
      ],
      "videos": [
        ""
      ],
      "time": 1575751600
    }
  ]
}